import React from "react";
import { Container, Row, Col, Card, Button } from "react-bootstrap";

function News() {
  const cardInfo = [
    {
      title: "दुर्घटनामा आइसर गाडी क्षति भएमा सगरमाथा इन्स्योरेन्सले भुक्तानी गर्ने",
      text: "काठमाडौं – सगरमाथा इन्स्योरेन्स र आइसर गाडीको बिक्रेता इस्टर्न एजेन्सीबीच क्यासलेस भुक्तानी सम्झौता भएको छ । अब सगरमाथा इन्स्योरेन्समा बीमा भएका आइसर कम्पनीका गाडीहरुको दुर्घटना भई क्षति पुगेमा इस्टर्नको आधिकारिक सर्भिस सेन्टरमा नगद भुक्तान",
      imgSrc: "holder.js/100px180",
    },
    {
      title: "सगरमाथा इन्स्योरेन्स र इस्टर्न एजेन्सीबीच सम्झौता",
      text: "काठमाडौं (अस) । सगरमाथा इन्स्योरेन्स कम्पनी र इस्टर्न एजेन्सीबीच क्यासलेस भुक्तानी सम्बन्धी सम्झौता सम्पन्न भएको छ । सगरमाथा इन्स्योरेन्सका प्रमुख कार्यकारी अधिकृत चंकी क्षेत्री र इस्टर्न एजेन्सीका प्रमुख कार्यकारी अधिकृत एन्ड प्रबन्ध निर्देशक प्रकाश पौडेलले",
      imgSrc: "holder.js/100px180",
    },
    {
      title: "दुर्घटनामा आइसर गाडी क्षति भएमा सगरमाथा इन्स्योरेन्सले भुक्तानी गर्ने",
      text: "काठमाडौं – सगरमाथा इन्स्योरेन्स र आइसर गाडीको बिक्रेता इस्टर्न एजेन्सीबीच क्यासलेस भुक्तानी सम्झौता भएको छ । अब सगरमाथा इन्स्योरेन्समा बीमा भएका आइसर कम्पनीका गाडीहरुको दुर्घटना भई क्षति पुगेमा इस्टर्नको आधिकारिक सर्भिस सेन्टरमा नगद भुक्तान",
      imgSrc: "holder.js/100px180",
    },
    {
      title: "सगरमाथा इन्स्योरेन्स र इस्टर्न एजेन्सीबीच सम्झौता",
      text: "काठमाडौं (अस) । सगरमाथा इन्स्योरेन्स कम्पनी र इस्टर्न एजेन्सीबीच क्यासलेस भुक्तानी सम्बन्धी सम्झौता सम्पन्न भएको छ । सगरमाथा इन्स्योरेन्सका प्रमुख कार्यकारी अधिकृत चंकी क्षेत्री र इस्टर्न एजेन्सीका प्रमुख कार्यकारी अधिकृत एन्ड प्रबन्ध निर्देशक प्रकाश पौडेलले",
      imgSrc: "holder.js/100px180",
    },
  ];

  return (
    <Container>
      <Row>
        <h2 class="heading mb-4">Latest News</h2>
        {cardInfo.map((card, index) => (
          <Col sm={12} md={6} lg={4} xl={3} key={index} className="mb-4">
            <Card style={{ width: "100%" }}>
              <Card.Body>
                <Card.Title>{card.title}</Card.Title>
                <Card.Text>{card.text}</Card.Text>
                <Button variant="primary">Read More</Button>
              </Card.Body>
            </Card>
          </Col>
        ))}
      </Row>
    </Container>
  );
}

export default News;
